Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.PaletteId
The palette identifier of the straight.
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.SizeString
The size display string for the straight that can be used by the user interface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.#ctor(System.String,System.Double,System.Double,System.Boolean,Autodesk.Revit.DB.ConnectorProfileType,System.Int32,System.Int32)
Creates a new instance of the FabricationPartSizeMap class.
size:
The size display string for the straight that can be used by the user interface.
widthDiameter:
The width or diameter of the straight.
depth:
The depth of the straight.
isProductList:
Set if the straight a product list or not.
profileType:
Set the shape of the straight.
serviceId:
Set the service identifier of the straight.
paletteId:
Set the palette identifier of the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.#ctor(System.String,System.Double,System.Double,System.Boolean)
Creates a new instance of the FabricationPartSizeMap class.
size:
The size display string for the straight that can be used by the user interface.
widthDiameter:
The width or diameter of the straight.
depth:
The depth of the straight.
isProductList:
Set if the straight a product list or not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.2